<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>PayloadContent</key>
			<dict>
				<key>com.apple.touristd</key>
				<dict>
					<key>Forced</key>
					<array>
						<dict>
							<key>mcx_preference_settings</key>
							<dict>
								<key>firstOSLogin</key>
								<date>2018-10-04T04:30:47Z</date>
								<key>seed-notificationDueDate-lQlm1yrMS0GPVyAL44id+A</key>
								<date>2018-10-04T08:30:47Z</date>
								<key>seed-numNotifications-+trJt2VsTvK1yfPGwOySDw</key>
								<string>0</string>
								<key>seed-numNotifications-/+vP78HsSh+Yeb4xJnUT9A</key>
								<string>0</string>
								<key>seed-numNotifications-2+LvxAVyT6qnV1sDMZT0NA</key>
								<string>0</string>
								<key>seed-numNotifications-40reAuuYTHOsx4oGcx4qrA</key>
								<string>0</string>
								<key>seed-numNotifications-APhNaYV1RxSS41lC7ZJJ9Q</key>
								<string>0</string>
								<key>seed-numNotifications-B70mVuHeT0WUgKh/VdUuZQ</key>
								<string>0</string>
								<key>seed-numNotifications-ETJeJ9/1QmmWUde7uK8fDg</key>
								<string>0</string>
								<key>seed-numNotifications-EWfaSdJwR/6f1BYGiyLpcQ</key>
								<string>0</string>
								<key>seed-numNotifications-EeEFv8cyS0CVe3ia2UEehA</key>
								<string>0</string>
								<key>seed-numNotifications-FQrkbNP9ThKQQtpqx2saFg</key>
								<string>0</string>
								<key>seed-numNotifications-GZAJdmpdSqmfH2PkCr8ebw</key>
								<string>0</string>
								<key>seed-numNotifications-JTecrrXDSVut2tSfltty9Q</key>
								<string>0</string>
								<key>seed-numNotifications-KwUoo0fRRM2VPmIm0V67xg</key>
								<string>0</string>
								<key>seed-numNotifications-LR2P9+rnQ2q9xSUy1ZgWOw</key>
								<string>0</string>
								<key>seed-numNotifications-MM3ne3nTR9eXFyVwZ5gN7Q</key>
								<string>0</string>
								<key>seed-numNotifications-Pa88nesPSO6POlutVN4/Sg</key>
								<string>0</string>
								<key>seed-numNotifications-SdV08ZZQRxOCWq6JBEXmfg</key>
								<string>0</string>
								<key>seed-numNotifications-UhiR1M79RWmXLIQr4M0AWw</key>
								<string>0</string>
								<key>seed-numNotifications-WEyaCPMVRB6HbnmRq9EnNQ</key>
								<string>0</string>
								<key>seed-numNotifications-We59wh+OTa6c1yas/yppwg</key>
								<string>0</string>
								<key>seed-numNotifications-b/dLke8ZTQaN9KKrxfwDQw</key>
								<string>0</string>
								<key>seed-numNotifications-bydF6fX5Sp6aBYdEXD0VwQ</key>
								<string>0</string>
								<key>seed-numNotifications-d+gfl8CNTNeauANKjf9WqA</key>
								<string>0</string>
								<key>seed-numNotifications-f/Pn3F4RScOh+GUBKO9sRA</key>
								<string>0</string>
								<key>seed-numNotifications-fWRpNw7IR3S3qxX63nmvMw</key>
								<string>0</string>
								<key>seed-numNotifications-krdWS8DSQIqJSqQFXW1/pw</key>
								<string>0</string>
								<key>seed-numNotifications-kti4ZkMKQFyCL2kbgCY23A</key>
								<string>0</string>
								<key>seed-numNotifications-lEDfW5O+SZe8KTQ93HGOPA</key>
								<string>0</string>
								<key>seed-numNotifications-lQlm1yrMS0GPVyAL44id+A</key>
								<string>1</string>
								<key>seed-numNotifications-n87FVu1TSwGzble8vqBvsg</key>
								<string>0</string>
								<key>seed-numNotifications-pDWyREoARJm5V1mJYr9GKg</key>
								<string>0</string>
								<key>seed-numNotifications-srluh6uOQiuWCzxguqhDNw</key>
								<string>0</string>
								<key>seed-viewed-lQlm1yrMS0GPVyAL44id+A</key>
								<date>2018-10-04T04:31:34Z</date>
							</dict>
						</dict>
					</array>
				</dict>
			</dict>
			<key>PayloadEnabled</key>
			<true/>
			<key>PayloadIdentifier</key>
			<string>MCXToProfile.c9db05a8-1cb7-4e5c-b732-7859d9931d64.alacarte.customsettings.bc1bba29-efd7-4cc8-9a10-36e550c22c4b</string>
			<key>PayloadType</key>
			<string>com.apple.ManagedClient.preferences</string>
			<key>PayloadUUID</key>
			<string>bc1bba29-efd7-4cc8-9a10-36e550c22c4b</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
		</dict>
	</array>
	<key>PayloadDescription</key>
	<string>Prevents the MacOS Mojave welcome tour notification</string>
	<key>PayloadDisplayName</key>
	<string>Skip Mojave Welcome Tour</string>
	<key>PayloadIdentifier</key>
	<string>org.mozilla.SkipMojaveWelcomeTour</string>
	<key>PayloadOrganization</key>
	<string></string>
	<key>PayloadRemovalDisallowed</key>
	<true/>
	<key>PayloadScope</key>
	<string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>c9db05a8-1cb7-4e5c-b732-7859d9931d64</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
